---
kind: property
id: P:Autodesk.Revit.DB.ClosestPointsPairBetweenTwoCurves.XYZPointOnFirstCurve
source: html/657204cd-875f-01ba-54e3-62af5cbf7dd8.htm
---
# Autodesk.Revit.DB.ClosestPointsPairBetweenTwoCurves.XYZPointOnFirstCurve Property

Point on the first curve in 3d coordinates.

## Syntax (C#)
```csharp
public XYZ XYZPointOnFirstCurve { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null
- **Autodesk.Revit.Exceptions.InvalidOperationException** - The property has not been set by the method providing the result.